<h1>Multivariate Linear Regression</h1>

In [24]:
import pandas as pd
from word2number import w2n
from sklearn.linear_model import LinearRegression

In [2]:
df=pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [6]:
median=df['test_score(out of 10)'].median()
median

8.0

In [17]:
df['experience'].fillna('One',inplace=True)

In [18]:
df['test_score(out of 10)'].fillna(median,inplace=True)

df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        One                    8.0                           9      50000
1        One                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [23]:
numbers = [w2n.word_to_num(row['experience']) for label,row in df.iterrows() ]
df['experience']=numbers
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           1                    8.0                           9      50000
1           1                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [25]:
model=LinearRegression()

In [26]:
X=df.drop(['salary($)'],axis=1)
y=df['salary($)']
model.fit(X,y)

LinearRegression()

In [27]:
model.coef_

array([3031.1979513 , 1893.22650937, 2485.73083785])

In [28]:
model.intercept_

13359.721134159736

In [29]:
model.predict([[2,9,6]])

array([51375.54064819])

In [30]:
model.predict([[12,10,10]])

array([93523.67002192])